SoftwareBugger/STM32_learning_projects/ex6_systick/Public/system.h
#ifndef _SYSTEM_H
#define _SYSTEM_H


#include "stm32f10x.h"


// BIT BAND conversion, each bit is mapped to 4 bytes in the bit band region. addr is either 0x20000000 or 0x40000000
#define BITBAND(addr, bitnum) ((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2)) 
// cast addr to a correct data type
#define MEM_ADDR(addr)  *((volatile unsigned long  *)(addr)) 
// last step
#define BIT_ADDR(addr, bitnum)   MEM_ADDR(BITBAND(addr, bitnum)) 

//IO register memory mapping
#define GPIOA_ODR_Addr    (GPIOA_BASE+12) //0x4001080C 
#define GPIOB_ODR_Addr    (GPIOB_BASE+12) //0x40010C0C 
#define GPIOC_ODR_Addr    (GPIOC_BASE+12) //0x4001100C 
#define GPIOD_ODR_Addr    (GPIOD_BASE+12) //0x4001140C 
#define GPIOE_ODR_Addr    (GPIOE_BASE+12) //0x4001180C 
#define GPIOF_ODR_Addr    (GPIOF_BASE+12) //0x40011A0C    
#define GPIOG_ODR_Addr    (GPIOG_BASE+12) //0x40011E0C    

#define GPIOA_IDR_Addr    (GPIOA_BASE+8) //0x40010808 
#define GPIOB_IDR_Addr    (GPIOB_BASE+8) //0x40010C08 
#define GPIOC_IDR_Addr    (GPIOC_BASE+8) //0x40011008 
#define GPIOD_IDR_Addr    (GPIOD_BASE+8) //0x40011408 
#define GPIOE_IDR_Addr    (GPIOE_BASE+8) //0x40011808 
#define GPIOF_IDR_Addr    (GPIOF_BASE+8) //0x40011A08 
#define GPIOG_IDR_Addr    (GPIOG_BASE+8) //0x40011E08 
 
//return the bit banding mapped mem region for input/output of GPIO
// n is in range of 0 to 15, each register is 16 bits
#define PAout(n)   BIT_ADDR(GPIOA_ODR_Addr,n)  //output 
#define PAin(n)    BIT_ADDR(GPIOA_IDR_Addr,n)  //input 

#define PBout(n)   BIT_ADDR(GPIOB_ODR_Addr,n)  //output    
#define PBin(n)    BIT_ADDR(GPIOB_IDR_Addr,n)  //input 

#define PCout(n)   BIT_ADDR(GPIOC_ODR_Addr,n)  //output 
#define PCin(n)    BIT_ADDR(GPIOC_IDR_Addr,n)  //input 

#define PDout(n)   BIT_ADDR(GPIOD_ODR_Addr,n)  //output 
#define PDin(n)    BIT_ADDR(GPIOD_IDR_Addr,n)  //input 

#define PEout(n)   BIT_ADDR(GPIOE_ODR_Addr,n)  //output 
#define PEin(n)    BIT_ADDR(GPIOE_IDR_Addr,n)  //input

#define PFout(n)   BIT_ADDR(GPIOF_ODR_Addr,n)  //output 
#define PFin(n)    BIT_ADDR(GPIOF_IDR_Addr,n)  //input

#define PGout(n)   BIT_ADDR(GPIOG_ODR_Addr,n)  //output 
#define PGin(n)    BIT_ADDR(GPIOG_IDR_Addr,n)  //input


#endif